<?php require_once 'config.php';
require_once 'functions.php';
$page_title = 'О кафедре';
include 'header.php'; ?>
<main class="main-content">
	<section class="about-section">
		<h2>История кафедры</h2>
		<p>В 1978 г. на базе физико-математического факультета Северо-Осетинского государственного университета был образован Факультет математики. В 2007 г. факультет переименован в факультет математики и информационных технологий, а в сентябре 2020г. – в Факультет математики и компьютерных наук.&nbsp;Сегодня <strong>Факультет математики и компьютерных наук</strong> является одним из динамично развивающихся факультетов СОГУ.</p>
		<p>Факультет готовит учёных и специалистов-практиков: математиков, программистов, аналитиков и исследователей, которые смогут заниматься наукой и создавать новые технологии. Предлагаемые на факультете программы подготовки предназначены для тех, кто любит математику и её приложения. Они направлены на подготовку специалистов, глубоко понимающих математические идеи, лежащие в основе информатики, и владеющих принципами современных информационных технологий. В процессе обучения студенты учатся программировать на <strong>Python</strong> и <strong>С++</strong>, <strong>Go</strong> осваивают операционные системы и технологии Web-программирования, системы управления базами данных.</p>
		<p>Для успешной учебы студентов на факультете созданы все условия: учебные занятия проводятся в уютных аудиториях и оборудованных кабинетах, на кафедрах работают кружки и семинары для научно-исследовательской работы студентов и аспирантов. Нуждающимся в жилье студентам предоставляется общежитие с хорошими жилищно-бытовыми условиями. На факультете имеются 6 компьютерных классов, шесть больших лекционных залов оборудованы для чтения лекций с использованием современных информационных технологий.</p>
		<p>Значительная часть образовательной программы посвящается проектной работе студента. Проектная работа организована на базе «<strong>Центра практик и проектной работы</strong>» факультета математики и компьютерных наук, а также на базе Технопарка «<strong>Кванториум</strong>». В рамках имеющихся договоренностей студенты нашего факультета имеют возможность проходить практику и стажироваться в ведущих научно-образовательных центрах России (<strong>Лаборатория Касперского</strong> (Москва); <strong>Лаборатория информационных технологий Объединенного института ядерных исследований</strong> (Дубна)).</p>
		<p>Факультет предлагает всем своим студентам интенсивный творческий процесс обучения, увлекательную и насыщенную студенческую жизнь. Показателем качества учебы студентов факультета является не только высокая востребованность наших выпускников, но и их победы на различных олимпиадах и конкурсах по математике и информатике, в том числе, на международных, всероссийских и региональных.</p>
		<h2>Информация для поступающих в 2023 году</h2>
		<h2><span style="color: #000000">Бакалавриат:</span></h2>
		<div class="img-anchor"><a href="#1" class="no-fancybox"><span>Информатика и вычислительная техника</span></a><a href="#2" class="no-fancybox"><span>Прикладная математика и информатика: Программирование, анализ данных </span></a><a href="#4" class="no-fancybox"><span>Педагогическое образование: Математика, информатика</span></a></div>
		<p>&nbsp;</p>
		<h2><a href="https://youtu.be/PrUEsFC15Zk"><span style="color: #000000">Магистратура:</span></a></h2>
		<div class="img-anchor"><a href="#5" class="no-fancybox"><span>Математическое и информационное обеспечение произв. деятельности</span></a></div>
		<div></div>
		<div></div>
		<h2><span style="color: #000000">Аспирантура:</span></h2>
		<p>На факультете функционирует аспирантура по направлению подготовки 01.06.01 Математика и механика. Направленности:<br>
			01.01.01 — Вещественный, комплексный и функциональный анализ;<br>
			01.01.02 Дифференциальные уравнения, динамические системы и оптимальное управление;<br>
			01.04.01 Математическая логика, алгебра и теория чисел.</p>
		<p>&nbsp;</p>
		<hr>
		<p><a name="1"></a></p>
		<h3><span style="color: #000080">Программа бакалавриата 09.03.01 <strong>«Информатика и вычислительная техника»</strong></span></h3>
		<p><strong>Вступительные испытания:</strong></p>
		<ul>
			<li>Математика (профильная);</li>
			<li>Информатика и ИКТ <strong><em>или</em></strong> Физика (<em>по выбору поступающего</em>);</li>
			<li>Русский язык.</li>
		</ul>
		<p>Срок обучения – 4 года. Форма обучения: очная<br>
			Количество мест: 25 бюджетных, 5 внебюджетных</p>
		<p><a href="https://drive.google.com/file/d/1bLUWi00B42JK9hbPW7LrymcEbTm_cJv-/view?usp=share_link"><span style="color: #333399"><span style="color: #0000ff">Учебный план</span></span></a> (год начала подготовки 2023)</p>
		<p><strong>Профессии выпускника:</strong></p>
		<ul>
			<li>программист (программист-разработчик);</li>
			<li>администратор баз данных;</li>
			<li>специалист по безопасности компьютерных систем и сетей;</li>
			<li>специалист по информационным системам;</li>
			<li>специалист по проектированию пользовательских интерфейсов.</li>
		</ul>
		<p><strong>Продолжение обучения</strong><br>
			Выпускники программы могут продолжить обучение на магистерской программе «Прикладная математика и информатика», профиль «Математическое и информационное обеспечение производственной деятельности», а также магистерских программах ведущих российских университетов ВШЭ, ИТМО, СПГУ и др.</p>
		<p><strong>Тел. для справок:</strong> 8(918) 706-76-68</p>
		<hr>
		<p><a name="2"></a></p>
		<h3><span style="color: #000080">Программа бакалавриата 01.03.02 <strong>«Прикладная математика и информатика»&nbsp;</strong></span></h3>
		<h3>Профиль:&nbsp;<span style="color: #0000ff"><strong><em>«<span style="color: #3366ff">Программирование, анализ данных и математическое моделирование»</span></em></strong></span></h3>
		<p><strong>Вступительные испытания:</strong><br>
			– Математика (профильная);<br>
			– Информатика и ИКТ&nbsp; <strong><em>или</em></strong>&nbsp; Физика (<em>по выбору обучающегося</em>);<br>
			– Русский язык.</p>
		<p>Срок обучения – 4 года. Форма обучения: очная<br>
			Количество мест: 40 бюджетных, 10 внебюджетных</p>
		<p><span style="color: #3366ff"><a href="https://drive.google.com/file/d/1v7jAkSMY2xV_H7ZWluLStIzRGDYwHGSn/view?usp=share_link" style="color: #3366ff">Учебный план&nbsp;</a> (год начала подготовки 2023)</span></p>
		<p><strong>Целью программы является подготовка специалистов:</strong></p>
		<ul>
			<li>по разработке программного обеспечения (программист, программист-разработчик, специалист по информационным системам, администратор баз данных, web-разработчик);</li>
			<li>по работе с данными (Data Scientist, специалист по машинному обучению и искусственному интеллекту, системный аналитик, бизнес-аналитик);</li>
			<li>по математическому и компьютерному моделированию (исследователь, научный сотрудник, математик-прикладник).</li>
		</ul>
		<p><strong> Профессии выпускника:</strong></p>
		<ul>
			<li>программист (программист-разработчик);</li>
			<li>специалист по информационным системам;</li>
			<li>системный аналитик (бизнес-аналитик);</li>
			<li>администратор баз данных;</li>
			<li>web-разработчик;</li>
			<li>исследователь (научный сотрудник)</li>
		</ul>
		<p><strong>Продолжение обучения</strong><br>
			Выпускники программы могут продолжить обучение на магистерской программе «Прикладная математика и информатика», профиль «Математическое и информационное обеспечение производственной деятельности», а также магистерских программах ведущих российских университетов ВШЭ, ИТМО, СПГУ и др.</p>
		<p><strong>Тел. для справок:</strong> 8(918) 706-76-68</p>
		<hr>
		<p><a name="4"></a></p>
		<h3><span style="color: #000080">Программа бакалавриата</span><strong><span style="color: #000080"> 44.03.05 «Педагогическое образование»</span> с двумя профилями подготовки <span style="color: #3366ff"><em>«Математика. Информатика»</em></span></strong></h3>
		<p><strong>Вступительные испытания:</strong><br>
			– Обществознание;<br>
			– Математика (профильная) <strong><em>или</em></strong>&nbsp; Информатика и ИКТ (<em>по выбору обучающегося</em>);<br>
			– Русский язык.</p>
		<p>Срок обучения – 5 лет. Форма обучения: очная<br>
			Количество мест: 15 бюджетных, 5 внебюджетных</p>
		<p>Программа направлена на подготовку бакалавров, владеющих знаниями двух предметных областей – математики и информатики и адресована тем, кто интересуется математикой, информатикой и информационными технологиями; хочет стать высококвалифицированным профессионалом в этих областях, желает связать свою судьбу с преподаванием математики и информатики или с работой в сфере информационных технологий.</p>
		<p><strong>Сферы профессиональной деятельности:</strong></p>
		<ul>
			<li>Современный учитель школы: информатика, математика (алгебра и геометрия);</li>
			<li>Преподаватель специальных дисциплин: компьютерное моделирование, программирование, информационные системы, информационная безопасность, теория вероятностей, теория чисел, криптография и др.;</li>
			<li>Педагог дополнительного образования: детские центры, центры раннего развития по специализации компьютерная графика, анимация, робототехника, 3D-моделирование, программирование, научно-исследовательская работа;</li>
			<li>Software engineer: разработка, тестирование, внедрение и сопровождение программного обеспечения, системный администратор;</li>
			<li>Специалист по разработке программного обеспечения (программист, программист-разработчик, web-разработчик, разработчик обучающих программных сред);</li>
			<li>Специалист отдела информатизации предприятия, специалист по комплексной автоматизации бизнес-процессов.</li>
		</ul>
		<p><strong>Особенности обучения:</strong><br>
			В процессе обучения применяются активные и интерактивные методы обучения: групповая и индивидуальная работа, мастер-классы, разбор конкретных ситуаций (кейсов), проектная деятельность, дискуссии. Используются технологии смешанного обучения, предусматривающие активное использование различных электронных цифровых образовательных ресурсов (включая разработанные преподавателями онлайн-курсы) и других программных продуктов. Большая часть практических и лабораторных работ проходит в специально оборудованных компьютерных классах, для лекций используются аудитории, оборудованные интерактивными досками и проекторами.</p>
		<p>Совмещение профилей позволяет углубить предметно-методическую подготовку будущего профессионала: будущий преподаватель математики приобретает умения в области разработки электронных образовательных ресурсов, использования информационных технологий в образовании, учитель информатики – глубокие знания математических основ информатики.</p>
		<p>Образовательная программа включает разные виды практик, проходящих на базе университета и образовательных учреждений РСО-А. В рамках учебной проектно-технологической практики осуществляется разработка индивидуальных и групповых проектов, проектирование учебных занятий.<br>
			Производственная педагогическая практика проводится на базе детских оздоровительных лагерей и школ, производственная технологическая практика связана с разработкой дидактических компьютерных материалов.</p>
		<p><span style="color: #3366ff"><a href="https://drive.google.com/file/d/1xfNWsiC0LraIUACDIDfYAqlzNqKhI31A/view?usp=sharing" style="color: #3366ff">Учебный план</a></span></p>
		<p><strong>Научные и творческие коллективы студентов</strong><br>
			Студенческая жизнь физико-математического факультета – яркая и насыщенная: спортивные соревнования, интеллектуальные игры, творческие вечера, квесты, конкурсы, олимпиады.<br>
			На факультете действуют научные лаборатории и центр практик.</p>
		<p><strong>Перспективы</strong><br>
			Имеется возможность продолжать свое обучение в магистратуре по направлениям подготовки:<br>
			01.04.01 «Математика» (очная форма обучения)<br>
			01.04.02 «Прикладная математика и информатика» (очная форма обучения)</p>
		<p><strong>Тел. для справок:</strong> 8(918) 821-37-81</p>
		<hr>
		<p><a name="5"></a></p>
		<h3><span style="color: #000080"> Программа магистратуры 01.04.02 «Прикладная математика и информатика»</span></h3>
		<h3>Направление (профиль): <span style="color: #3366ff"><strong>«Математическое и информационное обеспечение производственной деятельности»</strong></span></h3>
		<p><strong>Руководитель магистратуры:</strong> к.ф.-м.н. Басаева Елена Казбековна</p>
		<p>Срок обучения – 2 года. Форма обучения: очная<br>
			Количество мест: 9 бюджетных, 5 внебюджетных</p>
		<p><a href="https://drive.google.com/file/d/1weReaqd5Phefb8-POehUwHWJTDv2OuYx/view?usp=share_link" style="color: #3366ff">Учебный план (год начала подготовки 2023)</a><a href="https://drive.google.com/file/d/19G8sEX4rCBImaQmBEK2QJtz4bSk5gIpp/view?usp=sharing" style="color: #3366ff"></a></p>
		<p><strong>Тел. для справок:</strong> 8(918) 706-76-68</p>
		<hr>
		<p>&nbsp;</p>
		<h2><span style="color: #000000">Аспирантура:</span></h2>
		<p>На факультете функционирует аспирантура по направлению подготовки 01.06.01 Математика и механика. Направленности:<br>
			01.01.01 Вещественный, комплексный и функциональный анализ;<br>
			01.01.02 Дифференциальные уравнения, динамические системы и оптимальное управление;<br>
			01.04.01 Математическая логика, алгебра и теория чисел.</p>
		<p><strong>Тел. для справок:</strong> 8(928) 838-83-48; 9(918) 828-66-42</p>
	</section>
</main>
<?php include 'footer.php'; ?>